apache/nuttx/arch/arm/src/lpc54xx/chip/lpc54_sdmmc.h
/************************************************************************************************
 * arch/arm/src/lpc54xx/lpc54_sdmmc.h
 *
 *   Copyright (C) 2017 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************************/

#ifndef __ARCH_ARM_SRC_LPC54XX_CHIP_LPC54_SDMMC_H
#define __ARCH_ARM_SRC_LPC54XX_CHIP_LPC54_SDMMC_H

/************************************************************************************************
 * Included Files
 ************************************************************************************************/

#include <nuttx/config.h>
#include "chip/lpc54_memorymap.h"

/************************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************************/

#define LPC54_TXFIFO_DEPTH               32
#define LPC54_TXFIFO_WIDTH               4
#define LPC54_RXFIFO_DEPTH               32
#define LPC54_RXFIFO_WIDTH               4

/* MCI register offsets (with respect to the MCI base) ******************************************/

#define LPC54_SDMMC_CTRL_OFFSET          0x0000 /* Control register */
#define LPC54_SDMMC_PWREN_OFFSET         0x0004 /* Power Enable Register */
#define LPC54_SDMMC_CLKDIV_OFFSET        0x0008 /* Clock-divider register */
#define LPC54_SDMMC_CLKENA_OFFSET        0x0010 /* Clock-enable register */
#define LPC54_SDMMC_TMOUT_OFFSET         0x0014 /* Time-out register */
#define LPC54_SDMMC_CTYPE_OFFSET         0x0018 /* Card-type register */
#define LPC54_SDMMC_BLKSIZ_OFFSET        0x001c /* Block-size register */
#define LPC54_SDMMC_BYTCNT_OFFSET        0x0020 /* Byte-count register */
#define LPC54_SDMMC_INTMASK_OFFSET       0x0024 /* Interrupt-mask register */
#define LPC54_SDMMC_CMDARG_OFFSET        0x0028 /* Command-argument register */
#define LPC54_SDMMC_CMD_OFFSET           0x002c /* Command register */
#define LPC54_SDMMC_RESP0_OFFSET         0x0030 /* Response-0 register */
#define LPC54_SDMMC_RESP1_OFFSET         0x0034 /* Response-1 register */
#define LPC54_SDMMC_RESP2_OFFSET         0x0038 /* Response-2 register */
#define LPC54_SDMMC_RESP3_OFFSET         0x003c /* Response-3 register */
#define LPC54_SDMMC_MINTSTS_OFFSET       0x0040 /* Masked interrupt-status register */
#define LPC54_SDMMC_RINTSTS_OFFSET       0x0044 /* Raw interrupt-status register */
#define LPC54_SDMMC_STATUS_OFFSET        0x0048 /* Status register */
#define LPC54_SDMMC_FIFOTH_OFFSET        0x004c /* FIFO threshold register */
#define LPC54_SDMMC_CDETECT_OFFSET       0x0050 /* Card-detect register value */
#define LPC54_SDMMC_WRTPRT_OFFSET        0x0054 /* Write-protect register */
#define LPC54_SDMMC_TCBCNT_OFFSET        0x005c /* Transferred CIU card byte count */
#define LPC54_SDMMC_TBBCNT_OFFSET        0x0060 /* Transferred host to BIU-FIFO byte count */
#define LPC54_SDMMC_DEBNCE_OFFSET        0x0064 /* Debounce count register */
#define LPC54_SDMMC_RSTN_OFFSET          0x0078 /* Hardware Reset */
#define LPC54_SDMMC_BMOD_OFFSET          0x0080 /* Bus Mode Register */
#define LPC54_SDMMC_PLDMND_OFFSET        0x0084 /* Poll Demand Register */
#define LPC54_SDMMC_DBADDR_OFFSET        0x0088 /* Descriptor List Base Address Register */
#define LPC54_SDMMC_IDSTS_OFFSET         0x008c /* Internal DMAC Status Register */
#define LPC54_SDMMC_IDINTEN_OFFSET       0x0090 /* Internal DMAC Interrupt Enable Register */
#define LPC54_SDMMC_DSCADDR_OFFSET       0x0094 /* Current Host Descriptor Address Register */
#define LPC54_SDMMC_BUFADDR_OFFSET       0x0098 /* Current Buffer Descriptor Address Register */
#define LPC54_SDMMC_CARDTHRCTL_OFFSET    0x0100 /* Card threshold control */
#define LPC54_SDMMC_BACKENDPWRL_OFFSET   0x0104 /* Power control */

#define LPC54_SDMMC_DATA_OFFSET          0x0200 /* Data FIFO read/write (>=) */

/* MCI register (virtual) addresses *************************************************************/

#define LPC54_SDMMC_CTRL                 (LPC54_SDMMC_BASE + LPC54_SDMMC_CTRL_OFFSET)
#define LPC54_SDMMC_PWREN                (LPC54_SDMMC_BASE + LPC54_SDMMC_PWREN_OFFSET)
#define LPC54_SDMMC_CLKDIV               (LPC54_SDMMC_BASE + LPC54_SDMMC_CLKDIV_OFFSET)
#define LPC54_SDMMC_CLKENA               (LPC54_SDMMC_BASE + LPC54_SDMMC_CLKENA_OFFSET)
#define LPC54_SDMMC_TMOUT                (LPC54_SDMMC_BASE + LPC54_SDMMC_TMOUT_OFFSET)
#define LPC54_SDMMC_CTYPE                (LPC54_SDMMC_BASE + LPC54_SDMMC_CTYPE_OFFSET)
#define LPC54_SDMMC_BLKSIZ               (LPC54_SDMMC_BASE + LPC54_SDMMC_BLKSIZ_OFFSET)
#define LPC54_SDMMC_BYTCNT               (LPC54_SDMMC_BASE + LPC54_SDMMC_BYTCNT_OFFSET)
#define LPC54_SDMMC_INTMASK              (LPC54_SDMMC_BASE + LPC54_SDMMC_INTMASK_OFFSET)
#define LPC54_SDMMC_CMDARG               (LPC54_SDMMC_BASE + LPC54_SDMMC_CMDARG_OFFSET)
#define LPC54_SDMMC_CMD                  (LPC54_SDMMC_BASE + LPC54_SDMMC_CMD_OFFSET)
#define LPC54_SDMMC_RESP0                (LPC54_SDMMC_BASE + LPC54_SDMMC_RESP0_OFFSET)
#define LPC54_SDMMC_RESP1                (LPC54_SDMMC_BASE + LPC54_SDMMC_RESP1_OFFSET)
#define LPC54_SDMMC_RESP2                (LPC54_SDMMC_BASE + LPC54_SDMMC_RESP2_OFFSET)
#define LPC54_SDMMC_RESP3                (LPC54_SDMMC_BASE + LPC54_SDMMC_RESP3_OFFSET)
#define LPC54_SDMMC_MINTSTS              (LPC54_SDMMC_BASE + LPC54_SDMMC_MINTSTS_OFFSET)
#define LPC54_SDMMC_RINTSTS              (LPC54_SDMMC_BASE + LPC54_SDMMC_RINTSTS_OFFSET)
#define LPC54_SDMMC_STATUS               (LPC54_SDMMC_BASE + LPC54_SDMMC_STATUS_OFFSET)
#define LPC54_SDMMC_FIFOTH               (LPC54_SDMMC_BASE + LPC54_SDMMC_FIFOTH_OFFSET)
#define LPC54_SDMMC_CDETECT              (LPC54_SDMMC_BASE + LPC54_SDMMC_CDETECT_OFFSET)
#define LPC54_SDMMC_WRTPRT               (LPC54_SDMMC_BASE + LPC54_SDMMC_WRTPRT_OFFSET)
#define LPC54_SDMMC_TCBCNT               (LPC54_SDMMC_BASE + LPC54_SDMMC_TCBCNT_OFFSET)
#define LPC54_SDMMC_TBBCNT               (LPC54_SDMMC_BASE + LPC54_SDMMC_TBBCNT_OFFSET)
#define LPC54_SDMMC_TBBCNT               (LPC54_SDMMC_BASE + LPC54_SDMMC_TBBCNT_OFFSET)
#define LPC54_SDMMC_DEBNCE               (LPC54_SDMMC_BASE + LPC54_SDMMC_DEBNCE_OFFSET)
#define LPC54_SDMMC_RSTN                 (LPC54_SDMMC_BASE + LPC54_SDMMC_RSTN_OFFSET)
#define LPC54_SDMMC_BMOD                 (LPC54_SDMMC_BASE + LPC54_SDMMC_BMOD_OFFSET)
#define LPC54_SDMMC_PLDMND               (LPC54_SDMMC_BASE + LPC54_SDMMC_PLDMND_OFFSET)
#define LPC54_SDMMC_DBADDR               (LPC54_SDMMC_BASE + LPC54_SDMMC_DBADDR_OFFSET)
#define LPC54_SDMMC_IDSTS                (LPC54_SDMMC_BASE + LPC54_SDMMC_IDSTS_OFFSET)
#define LPC54_SDMMC_IDINTEN              (LPC54_SDMMC_BASE + LPC54_SDMMC_IDINTEN_OFFSET)
#define LPC54_SDMMC_DSCADDR              (LPC54_SDMMC_BASE + LPC54_SDMMC_DSCADDR_OFFSET)
#define LPC54_SDMMC_BUFADDR              (LPC54_SDMMC_BASE + LPC54_SDMMC_BUFADDR_OFFSET)
#define LPC54_SDMMC_CARDTHRCTL           (LPC54_SDMMC_BASE + LPC54_SDMMC_CARDTHRCTL_OFFSET)
#define LPC54_SDMMC_BACKENDPWRL          (LPC54_SDMMC_BASE + LPC54_SDMMC_BACKENDPWRL_OFFSET)

